04_OpenFoam/_ref/OpenFOAM-14/incompressibleDenseParticleFluid/cyclone/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 12;

decomposer      simple;

distributor     zoltan;
libs            ("libzoltanDecomp.so");

// distributor     parMetis;
// libs            ("libparMetisDecomp.so");

simple
{
    n           (2 2 3);
}

zoltan
{
    lb_method   rcb;
}

// ************************************************************************* //
